; ModuleID = 'blocksort.c'
source_filename = "blocksort.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.EState = type { ptr, i32, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [38 x i8] c"      %d work, %d block, ratio %5.2f\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [54 x i8] c"    too repetitive; using fallback sorting algorithm\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [28 x i8] c"        bucket sorting ...\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [23 x i8] c"        depth %6d has \00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [24 x i8] c"%6d unresolved strings\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [34 x i8] c"        reconstructing block ...\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [34 x i8] c"        main sort initialise ...\0A\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [48 x i8] c"        qsort [0x%x, 0x%x]   done %d   this %d\0A\00", align 1, !dbg !34

!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1124, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 54)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 277, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 28)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 23)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 24)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 368, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 34)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 814, type: !29, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !2, line: 941, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 48)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1056, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 44)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "incs", scope: !46, file: !2, line: 527, type: !60, isLocal: true, isDefinition: true)
!46 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 21.1.5 (++20251023083201+45afac62e373-1~exp1~20251023083316.53)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !47, globals: !59, splitDebugInlining: false, nameTableKind: None)
!47 = !{!48, !52, !53, !54, !56, !49, !58}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !50, line: 87, baseType: !51)
!50 = !DIFile(filename: "./bzlib_private.h", directory: "/home/ez/Develop/llvm-project-main/build-external-llvm21/install/benchmark/bzip2/build_autojit_shlib", checksumkind: CSK_MD5, checksum: "5325523d55f5e1fa9d9d8a95214ec2fe")
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !50, line: 83, baseType: !55)
!55 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !50, line: 84, baseType: !57)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !50, line: 82, baseType: !55)
!59 = !{!0, !7, !12, !17, !22, !27, !32, !34, !39, !44}
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 448, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 14)
!63 = !{i32 7, !"Dwarf Version", i32 5}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{i32 1, !"wchar_size", i32 4}
!66 = !{i32 8, !"PIC Level", i32 2}
!67 = !{i32 7, !"PIE Level", i32 2}
!68 = !{i32 7, !"uwtable", i32 2}
!69 = !{i32 7, !"frame-pointer", i32 2}
!70 = !{!"Ubuntu clang version 21.1.5 (++20251023083201+45afac62e373-1~exp1~20251023083316.53)"}
!71 = distinct !DISubprogram(name: "BZ2_blockSort", scope: !2, file: !2, line: 1078, type: !72, scopeLine: 1079, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, retainedNodes: !162)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !50, line: 300, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 231, size: 446144, elements: !77)
!77 = !{!78, !105, !106, !107, !109, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !132, !134, !135, !136, !137, !138, !139, !140, !141, !142, !146, !150, !151, !155, !157, !158}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !76, file: !50, line: 233, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !81, line: 106, baseType: !82)
!81 = !DIFile(filename: "./bzlib.h", directory: "/home/ez/Develop/llvm-project-main/build-external-llvm21/install/benchmark/bzip2/build_autojit_shlib", checksumkind: CSK_MD5, checksum: "2630d715580548e1aacc6fac1a21250d")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 89, size: 640, elements: !83)
!83 = !{!84, !86, !88, !89, !90, !91, !92, !93, !94, !96, !100, !104}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !82, file: !81, line: 90, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !82, file: !81, line: 91, baseType: !87, size: 32, offset: 64)
!87 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !82, file: !81, line: 92, baseType: !87, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !82, file: !81, line: 93, baseType: !87, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !82, file: !81, line: 95, baseType: !85, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !82, file: !81, line: 96, baseType: !87, size: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !82, file: !81, line: 97, baseType: !87, size: 32, offset: 288)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !82, file: !81, line: 98, baseType: !87, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !82, file: !81, line: 100, baseType: !95, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !82, file: !81, line: 102, baseType: !97, size: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!95, !95, !57, !57}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !82, file: !81, line: 103, baseType: !101, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !95, !95}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !82, file: !81, line: 104, baseType: !95, size: 64, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !76, file: !50, line: 237, baseType: !56, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !76, file: !50, line: 238, baseType: !56, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !76, file: !50, line: 241, baseType: !108, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !50, line: 85, baseType: !87)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !76, file: !50, line: 244, baseType: !110, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !76, file: !50, line: 245, baseType: !110, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !76, file: !50, line: 246, baseType: !110, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !76, file: !50, line: 247, baseType: !56, size: 32, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !76, file: !50, line: 250, baseType: !110, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !76, file: !50, line: 251, baseType: !53, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !76, file: !50, line: 252, baseType: !48, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !76, file: !50, line: 253, baseType: !53, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !76, file: !50, line: 256, baseType: !56, size: 32, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !76, file: !50, line: 259, baseType: !108, size: 32, offset: 736)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !76, file: !50, line: 260, baseType: !56, size: 32, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !76, file: !50, line: 261, baseType: !56, size: 32, offset: 800)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !76, file: !50, line: 261, baseType: !56, size: 32, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !76, file: !50, line: 264, baseType: !56, size: 32, offset: 864)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !76, file: !50, line: 265, baseType: !56, size: 32, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !76, file: !50, line: 266, baseType: !56, size: 32, offset: 928)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !76, file: !50, line: 267, baseType: !56, size: 32, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !76, file: !50, line: 270, baseType: !56, size: 32, offset: 992)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !76, file: !50, line: 271, baseType: !129, size: 2048, offset: 1024)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 2048, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !76, file: !50, line: 272, baseType: !133, size: 2048, offset: 3072)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, elements: !130)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !76, file: !50, line: 275, baseType: !108, size: 32, offset: 5120)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !76, file: !50, line: 276, baseType: !56, size: 32, offset: 5152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !76, file: !50, line: 279, baseType: !108, size: 32, offset: 5184)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !76, file: !50, line: 280, baseType: !108, size: 32, offset: 5216)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !76, file: !50, line: 283, baseType: !56, size: 32, offset: 5248)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !76, file: !50, line: 284, baseType: !56, size: 32, offset: 5280)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !76, file: !50, line: 285, baseType: !56, size: 32, offset: 5312)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !76, file: !50, line: 288, baseType: !56, size: 32, offset: 5344)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !76, file: !50, line: 289, baseType: !143, size: 8256, offset: 5376)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8256, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 258)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !76, file: !50, line: 290, baseType: !147, size: 144016, offset: 13632)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 144016, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 18002)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !76, file: !50, line: 291, baseType: !147, size: 144016, offset: 157648)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !76, file: !50, line: 293, baseType: !152, size: 12384, offset: 301664)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 12384, elements: !153)
!153 = !{!154, !145}
!154 = !DISubrange(count: 6)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !76, file: !50, line: 294, baseType: !156, size: 49536, offset: 314048)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 49536, elements: !153)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !76, file: !50, line: 295, baseType: !156, size: 49536, offset: 363584)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !76, file: !50, line: 297, baseType: !159, size: 33024, offset: 413120)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 33024, elements: !160)
!160 = !{!145, !161}
!161 = !DISubrange(count: 4)
!162 = !{}
!163 = !DILocalVariable(name: "s", arg: 1, scope: !71, file: !2, line: 1078, type: !74)
!164 = !DILocation(line: 1078, column: 30, scope: !71)
!165 = !DILocalVariable(name: "ptr", scope: !71, file: !2, line: 1080, type: !110)
!166 = !DILocation(line: 1080, column: 12, scope: !71)
!167 = !DILocation(line: 1080, column: 21, scope: !71)
!168 = !DILocation(line: 1080, column: 24, scope: !71)
!169 = !DILocalVariable(name: "block", scope: !71, file: !2, line: 1081, type: !53)
!170 = !DILocation(line: 1081, column: 12, scope: !71)
!171 = !DILocation(line: 1081, column: 21, scope: !71)
!172 = !DILocation(line: 1081, column: 24, scope: !71)
!173 = !DILocalVariable(name: "ftab", scope: !71, file: !2, line: 1082, type: !110)
!174 = !DILocation(line: 1082, column: 12, scope: !71)
!175 = !DILocation(line: 1082, column: 21, scope: !71)
!176 = !DILocation(line: 1082, column: 24, scope: !71)
!177 = !DILocalVariable(name: "nblock", scope: !71, file: !2, line: 1083, type: !56)
!178 = !DILocation(line: 1083, column: 12, scope: !71)
!179 = !DILocation(line: 1083, column: 21, scope: !71)
!180 = !DILocation(line: 1083, column: 24, scope: !71)
!181 = !DILocalVariable(name: "verb", scope: !71, file: !2, line: 1084, type: !56)
!182 = !DILocation(line: 1084, column: 12, scope: !71)
!183 = !DILocation(line: 1084, column: 21, scope: !71)
!184 = !DILocation(line: 1084, column: 24, scope: !71)
!185 = !DILocalVariable(name: "wfact", scope: !71, file: !2, line: 1085, type: !56)
!186 = !DILocation(line: 1085, column: 12, scope: !71)
!187 = !DILocation(line: 1085, column: 21, scope: !71)
!188 = !DILocation(line: 1085, column: 24, scope: !71)
!189 = !DILocalVariable(name: "quadrant", scope: !71, file: !2, line: 1086, type: !48)
!190 = !DILocation(line: 1086, column: 12, scope: !71)
!191 = !DILocalVariable(name: "budget", scope: !71, file: !2, line: 1087, type: !56)
!192 = !DILocation(line: 1087, column: 12, scope: !71)
!193 = !DILocalVariable(name: "budgetInit", scope: !71, file: !2, line: 1088, type: !56)
!194 = !DILocation(line: 1088, column: 12, scope: !71)
!195 = !DILocalVariable(name: "i", scope: !71, file: !2, line: 1089, type: !56)
!196 = !DILocation(line: 1089, column: 12, scope: !71)
!197 = !DILocation(line: 1091, column: 8, scope: !198)
!198 = distinct !DILexicalBlock(scope: !71, file: !2, line: 1091, column: 8)
!199 = !DILocation(line: 1091, column: 15, scope: !198)
!200 = !DILocation(line: 1092, column: 22, scope: !201)
!201 = distinct !DILexicalBlock(scope: !198, file: !2, line: 1091, column: 24)
!202 = !DILocation(line: 1092, column: 25, scope: !201)
!203 = !DILocation(line: 1092, column: 31, scope: !201)
!204 = !DILocation(line: 1092, column: 34, scope: !201)
!205 = !DILocation(line: 1092, column: 40, scope: !201)
!206 = !DILocation(line: 1092, column: 46, scope: !201)
!207 = !DILocation(line: 1092, column: 54, scope: !201)
!208 = !DILocation(line: 1092, column: 7, scope: !201)
!209 = !DILocation(line: 1093, column: 4, scope: !201)
!210 = !DILocation(line: 1099, column: 11, scope: !211)
!211 = distinct !DILexicalBlock(scope: !198, file: !2, line: 1093, column: 11)
!212 = !DILocation(line: 1099, column: 17, scope: !211)
!213 = !DILocation(line: 1099, column: 9, scope: !211)
!214 = !DILocation(line: 1100, column: 11, scope: !215)
!215 = distinct !DILexicalBlock(scope: !211, file: !2, line: 1100, column: 11)
!216 = !DILocation(line: 1100, column: 13, scope: !215)
!217 = !DILocation(line: 1100, column: 19, scope: !215)
!218 = !DILocation(line: 1100, column: 18, scope: !215)
!219 = !DILocation(line: 1101, column: 30, scope: !211)
!220 = !DILocation(line: 1101, column: 36, scope: !211)
!221 = !DILocation(line: 1101, column: 16, scope: !211)
