; ModuleID = '/tmp/autojit_4f0e030a358521399cbed216e6c35c26'
source_filename = "compress.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.EState = type { ptr, i32, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [62 x i8] c"    block %d: crc = 0x%08x, combined CRC = 0x%08x, size = %d\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [36 x i8] c"    final combined CRC = 0x%08x\0A   \00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [64 x i8] c"      %d in block, %d after MTF & 1-2 coding, %d+2 syms in use\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [59 x i8] c"      initial group %d, [%d .. %d], has %d syms (%4.1f%%)\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [41 x i8] c"      pass %d: size is %d, grp uses are \00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [4 x i8] c"%d \00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [26 x i8] c"      bytes: mapping %d, \00", align 1, !dbg !37

!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 306, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 64)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 347, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 59)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 481, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 41)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 484, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 4)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 485, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 2)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 558, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 26)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 15)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 586, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 18)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 641, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 10)
!57 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 21.1.5 (++20251023083201+45afac62e373-1~exp1~20251023083316.53)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !58, globals: !67, splitDebugInlining: false, nameTableKind: None)
!58 = !{!59, !60, !63, !65, !66}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !61, line: 83, baseType: !62)
!61 = !DIFile(filename: "./bzlib_private.h", directory: "/home/ez/Develop/llvm-project-main/build-external-llvm21/install/benchmark/bzip2/build_autojit_shlib", checksumkind: CSK_MD5, checksum: "5325523d55f5e1fa9d9d8a95214ec2fe")
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !61, line: 85, baseType: !64)
!64 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !61, line: 82, baseType: !62)
!66 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!67 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52}
!68 = !{i32 7, !"Dwarf Version", i32 5}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{i32 1, !"wchar_size", i32 4}
!71 = !{i32 8, !"PIC Level", i32 2}
!72 = !{i32 7, !"PIE Level", i32 2}
!73 = !{i32 7, !"uwtable", i32 2}
!74 = !{i32 7, !"frame-pointer", i32 2}
!75 = !{!"Ubuntu clang version 21.1.5 (++20251023083201+45afac62e373-1~exp1~20251023083316.53)"}
!76 = distinct !DISubprogram(name: "bsPutUChar", scope: !2, file: !2, line: 138, type: !77, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !57, retainedNodes: !169)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !79, !60}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !61, line: 300, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 231, size: 446144, elements: !82)
!82 = !{!83, !110, !112, !113, !114, !116, !117, !118, !119, !120, !121, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !140, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154, !158, !159, !163, !165, !166}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !81, file: !61, line: 233, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !86, line: 106, baseType: !87)
!86 = !DIFile(filename: "./bzlib.h", directory: "/home/ez/Develop/llvm-project-main/build-external-llvm21/install/benchmark/bzip2/build_autojit_shlib", checksumkind: CSK_MD5, checksum: "2630d715580548e1aacc6fac1a21250d")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 89, size: 640, elements: !88)
!88 = !{!89, !91, !92, !93, !94, !95, !96, !97, !98, !100, !105, !109}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !87, file: !86, line: 90, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !87, file: !86, line: 91, baseType: !64, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !87, file: !86, line: 92, baseType: !64, size: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !87, file: !86, line: 93, baseType: !64, size: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !87, file: !86, line: 95, baseType: !90, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !87, file: !86, line: 96, baseType: !64, size: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !87, file: !86, line: 97, baseType: !64, size: 32, offset: 288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !87, file: !86, line: 98, baseType: !64, size: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !87, file: !86, line: 100, baseType: !99, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !87, file: !86, line: 102, baseType: !101, size: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!99, !99, !104, !104}
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !87, file: !86, line: 103, baseType: !106, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !99, !99}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !87, file: !86, line: 104, baseType: !99, size: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !81, file: !61, line: 237, baseType: !111, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !61, line: 84, baseType: !104)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !61, line: 238, baseType: !111, size: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !81, file: !61, line: 241, baseType: !63, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !81, file: !61, line: 244, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !81, file: !61, line: 245, baseType: !115, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !81, file: !61, line: 246, baseType: !115, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !81, file: !61, line: 247, baseType: !111, size: 32, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !81, file: !61, line: 250, baseType: !115, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !81, file: !61, line: 251, baseType: !59, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !81, file: !61, line: 252, baseType: !122, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !61, line: 87, baseType: !124)
!124 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !81, file: !61, line: 253, baseType: !59, size: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !81, file: !61, line: 256, baseType: !111, size: 32, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !81, file: !61, line: 259, baseType: !63, size: 32, offset: 736)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !81, file: !61, line: 260, baseType: !111, size: 32, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !81, file: !61, line: 261, baseType: !111, size: 32, offset: 800)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !81, file: !61, line: 261, baseType: !111, size: 32, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !81, file: !61, line: 264, baseType: !111, size: 32, offset: 864)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !81, file: !61, line: 265, baseType: !111, size: 32, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !81, file: !61, line: 266, baseType: !111, size: 32, offset: 928)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !81, file: !61, line: 267, baseType: !111, size: 32, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !81, file: !61, line: 270, baseType: !111, size: 32, offset: 992)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !81, file: !61, line: 271, baseType: !137, size: 2048, offset: 1024)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2048, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !81, file: !61, line: 272, baseType: !141, size: 2048, offset: 3072)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !138)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !81, file: !61, line: 275, baseType: !63, size: 32, offset: 5120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !81, file: !61, line: 276, baseType: !111, size: 32, offset: 5152)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !81, file: !61, line: 279, baseType: !63, size: 32, offset: 5184)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !81, file: !61, line: 280, baseType: !63, size: 32, offset: 5216)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !81, file: !61, line: 283, baseType: !111, size: 32, offset: 5248)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !81, file: !61, line: 284, baseType: !111, size: 32, offset: 5280)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !81, file: !61, line: 285, baseType: !111, size: 32, offset: 5312)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !81, file: !61, line: 288, baseType: !111, size: 32, offset: 5344)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !81, file: !61, line: 289, baseType: !151, size: 8256, offset: 5376)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 8256, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 258)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !81, file: !61, line: 290, baseType: !155, size: 144016, offset: 13632)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 144016, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 18002)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !81, file: !61, line: 291, baseType: !155, size: 144016, offset: 157648)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !81, file: !61, line: 293, baseType: !160, size: 12384, offset: 301664)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 12384, elements: !161)
!161 = !{!162, !153}
!162 = !DISubrange(count: 6)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !81, file: !61, line: 294, baseType: !164, size: 49536, offset: 314048)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 49536, elements: !161)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !81, file: !61, line: 295, baseType: !164, size: 49536, offset: 363584)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !81, file: !61, line: 297, baseType: !167, size: 33024, offset: 413120)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 33024, elements: !168)
!168 = !{!153, !31}
!169 = !{}
!170 = !DILocalVariable(name: "s", arg: 1, scope: !76, file: !2, line: 138, type: !79)
!171 = !DILocation(line: 138, column: 27, scope: !76)
!172 = !DILocalVariable(name: "c", arg: 2, scope: !76, file: !2, line: 138, type: !60)
!173 = !DILocation(line: 138, column: 36, scope: !76)
!174 = !DILocation(line: 140, column: 9, scope: !76)
!175 = !DILocation(line: 140, column: 23, scope: !76)
!176 = !DILocation(line: 140, column: 15, scope: !76)
!177 = !DILocation(line: 140, column: 4, scope: !76)
!178 = !DILocation(line: 141, column: 1, scope: !76)
!179 = distinct !DISubprogram(name: "bsPutUInt32", scope: !2, file: !2, line: 127, type: !180, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !57, retainedNodes: !169)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !79, !63}
!182 = !DILocalVariable(name: "s", arg: 1, scope: !179, file: !2, line: 127, type: !79)
!183 = !DILocation(line: 127, column: 28, scope: !179)
!184 = !DILocalVariable(name: "u", arg: 2, scope: !179, file: !2, line: 127, type: !63)
!185 = !DILocation(line: 127, column: 38, scope: !179)
!186 = !DILocation(line: 129, column: 10, scope: !179)
!187 = !DILocation(line: 129, column: 17, scope: !179)
!188 = !DILocation(line: 129, column: 19, scope: !179)
!189 = !DILocation(line: 129, column: 16, scope: !179)
!190 = !DILocation(line: 129, column: 26, scope: !179)
!191 = !DILocation(line: 129, column: 4, scope: !179)
!192 = !DILocation(line: 130, column: 10, scope: !179)
!193 = !DILocation(line: 130, column: 17, scope: !179)
!194 = !DILocation(line: 130, column: 19, scope: !179)
!195 = !DILocation(line: 130, column: 16, scope: !179)
!196 = !DILocation(line: 130, column: 26, scope: !179)
!197 = !DILocation(line: 130, column: 4, scope: !179)
!198 = !DILocation(line: 131, column: 10, scope: !179)
!199 = !DILocation(line: 131, column: 17, scope: !179)
!200 = !DILocation(line: 131, column: 19, scope: !179)
!201 = !DILocation(line: 131, column: 16, scope: !179)
!202 = !DILocation(line: 131, column: 26, scope: !179)
!203 = !DILocation(line: 131, column: 4, scope: !179)
!204 = !DILocation(line: 132, column: 10, scope: !179)
!205 = !DILocation(line: 132, column: 17, scope: !179)
!206 = !DILocation(line: 132, column: 26, scope: !179)
!207 = !DILocation(line: 132, column: 4, scope: !179)
!208 = !DILocation(line: 133, column: 1, scope: !179)
!209 = distinct !DISubprogram(name: "bsW", scope: !2, file: !2, line: 117, type: !210, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !57, retainedNodes: !169)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !79, !111, !63}
!212 = !DILocalVariable(name: "s", arg: 1, scope: !209, file: !2, line: 117, type: !79)
!213 = !DILocation(line: 117, column: 20, scope: !209)
!214 = !DILocalVariable(name: "n", arg: 2, scope: !209, file: !2, line: 117, type: !111)
!215 = !DILocation(line: 117, column: 29, scope: !209)
!216 = !DILocalVariable(name: "v", arg: 3, scope: !209, file: !2, line: 117, type: !63)
!217 = !DILocation(line: 117, column: 39, scope: !209)
!218 = !DILocation(line: 119, column: 4, scope: !219)
!219 = distinct !DILexicalBlock(scope: !209, file: !2, line: 119, column: 4)
!220 = !DILocation(line: 119, column: 4, scope: !221)
!221 = distinct !DILexicalBlock(scope: !219, file: !2, line: 119, column: 4)
!222 = distinct !{!222, !218, !218, !223}
!223 = !{!"llvm.loop.mustprogress"}
!224 = !DILocation(line: 120, column: 18, scope: !209)
!225 = !DILocation(line: 120, column: 29, scope: !209)
!226 = !DILocation(line: 120, column: 32, scope: !209)
!227 = !DILocation(line: 120, column: 27, scope: !209)
!228 = !DILocation(line: 120, column: 41, scope: !209)
!229 = !DILocation(line: 120, column: 39, scope: !209)
