; ModuleID = '/tmp/autojit_a67b8472f07710730b1a65a68ac67bd7'
source_filename = "bzlib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.EState = type { ptr, i32, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.bz_stream = type { ptr, i32, i32, i32, ptr, i32, i32, i32, ptr, ptr, ptr, ptr }
%struct.DState = type { ptr, i32, i8, i32, i8, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, [256 x i32], i32, [257 x i32], [257 x i32], ptr, ptr, ptr, i32, i32, i32, i32, i32, [256 x i8], [16 x i8], [256 x i8], [4096 x i8], [16 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [6 x [258 x i32]], [6 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr }

@stderr = external global ptr, align 8

!2 = !DIFile(filename: "bzlib.c", directory: "/home/ez/Develop/llvm-project-main/build-external-llvm21/install/benchmark/bzip2/build_autojit_shlib", checksumkind: CSK_MD5, checksum: "e9102cb29eb978e014a27ac5a82e01da")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3544, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 443)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8456, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 1057)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 871, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 18)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 873, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 2)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 889, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 55)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1413, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 19)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "bzerrorstrings", scope: !34, file: !2, line: 1583, type: !220, isLocal: true, isDefinition: true)
!34 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 21.1.5 (++20251023083201+45afac62e373-1~exp1~20251023083316.53)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !52, globals: !162, splitDebugInlining: false, nameTableKind: None)
!35 = !{!36}
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 46, baseType: !38, size: 32, elements: !39)
!37 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!40 = !DIEnumerator(name: "_ISupper", value: 256)
!41 = !DIEnumerator(name: "_ISlower", value: 512)
!42 = !DIEnumerator(name: "_ISalpha", value: 1024)
!43 = !DIEnumerator(name: "_ISdigit", value: 2048)
!44 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!45 = !DIEnumerator(name: "_ISspace", value: 8192)
!46 = !DIEnumerator(name: "_ISprint", value: 16384)
!47 = !DIEnumerator(name: "_ISgraph", value: 32768)
!48 = !DIEnumerator(name: "_ISblank", value: 1)
!49 = !DIEnumerator(name: "_IScntrl", value: 2)
!50 = !DIEnumerator(name: "_ISpunct", value: 4)
!51 = !DIEnumerator(name: "_ISalnum", value: 8)
!52 = !{!53, !54, !58, !61, !63, !64, !62, !55, !135, !76, !60}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !56, line: 83, baseType: !57)
!56 = !DIFile(filename: "./bzlib_private.h", directory: "/home/ez/Develop/llvm-project-main/build-external-llvm21/install/benchmark/bzip2/build_autojit_shlib", checksumkind: CSK_MD5, checksum: "5325523d55f5e1fa9d9d8a95214ec2fe")
!57 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !56, line: 87, baseType: !60)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !56, line: 85, baseType: !38)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !56, line: 82, baseType: !57)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "bzFile", file: !2, line: 946, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 937, size: 40832, elements: !67)
!67 = !{!68, !129, !134, !136, !137, !160, !161}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !66, file: !2, line: 938, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !71, line: 7, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !73, line: 49, size: 1728, elements: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!74 = !{!75, !77, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !94, !95, !96, !100, !101, !103, !107, !110, !112, !115, !118, !119, !120, !124, !125}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !73, line: 51, baseType: !76, size: 32)
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !72, file: !73, line: 54, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !72, file: !73, line: 55, baseType: !78, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !72, file: !73, line: 56, baseType: !78, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !72, file: !73, line: 57, baseType: !78, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !72, file: !73, line: 58, baseType: !78, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !72, file: !73, line: 59, baseType: !78, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !72, file: !73, line: 60, baseType: !78, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !72, file: !73, line: 61, baseType: !78, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !72, file: !73, line: 64, baseType: !78, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !72, file: !73, line: 65, baseType: !78, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !72, file: !73, line: 66, baseType: !78, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !72, file: !73, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !73, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !72, file: !73, line: 70, baseType: !93, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !72, file: !73, line: 72, baseType: !76, size: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !72, file: !73, line: 73, baseType: !76, size: 32, offset: 928)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !72, file: !73, line: 74, baseType: !97, size: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !98, line: 152, baseType: !99)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!99 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !72, file: !73, line: 77, baseType: !60, size: 16, offset: 1024)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !72, file: !73, line: 78, baseType: !102, size: 8, offset: 1040)
!102 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !72, file: !73, line: 79, baseType: !104, size: 8, offset: 1048)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 1)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !72, file: !73, line: 81, baseType: !108, size: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !73, line: 43, baseType: null)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !73, line: 89, baseType: !111, size: 64, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !98, line: 153, baseType: !99)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !72, file: !73, line: 91, baseType: !113, size: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !73, line: 37, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !72, file: !73, line: 92, baseType: !116, size: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !73, line: 38, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !72, file: !73, line: 93, baseType: !93, size: 64, offset: 1344)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !72, file: !73, line: 94, baseType: !53, size: 64, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !72, file: !73, line: 95, baseType: !121, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 18, baseType: !123)
!122 = !DIFile(filename: "/usr/lib/llvm-21/lib/clang/21/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!123 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !72, file: !73, line: 96, baseType: !76, size: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !72, file: !73, line: 98, baseType: !126, size: 160, offset: 1568)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 20)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !66, file: !2, line: 939, baseType: !130, size: 40000, offset: 64)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 40000, elements: !132)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !56, line: 81, baseType: !4)
!132 = !{!133}
!133 = !DISubrange(count: 5000)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bufN", scope: !66, file: !2, line: 940, baseType: !135, size: 32, offset: 40064)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !56, line: 84, baseType: !76)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !66, file: !2, line: 941, baseType: !63, size: 8, offset: 40096)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !66, file: !2, line: 942, baseType: !138, size: 640, offset: 40128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !139, line: 106, baseType: !140)
!139 = !DIFile(filename: "./bzlib.h", directory: "/home/ez/Develop/llvm-project-main/build-external-llvm21/install/benchmark/bzip2/build_autojit_shlib", checksumkind: CSK_MD5, checksum: "2630d715580548e1aacc6fac1a21250d")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 89, size: 640, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !155, !159}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !140, file: !139, line: 90, baseType: !78, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !140, file: !139, line: 91, baseType: !38, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !140, file: !139, line: 92, baseType: !38, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !140, file: !139, line: 93, baseType: !38, size: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !140, file: !139, line: 95, baseType: !78, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !140, file: !139, line: 96, baseType: !38, size: 32, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !140, file: !139, line: 97, baseType: !38, size: 32, offset: 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !140, file: !139, line: 98, baseType: !38, size: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !139, line: 100, baseType: !53, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !140, file: !139, line: 102, baseType: !152, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!53, !53, !76, !76}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !140, file: !139, line: 103, baseType: !156, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !53, !53}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !140, file: !139, line: 104, baseType: !53, size: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lastErr", scope: !66, file: !2, line: 943, baseType: !135, size: 32, offset: 40768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "initialisedOk", scope: !66, file: !2, line: 944, baseType: !63, size: 8, offset: 40800)
!162 = !{!0, !7, !12, !17, !22, !27, !163, !165, !167, !169, !171, !176, !181, !186, !191, !196, !201, !206, !208, !213, !215, !32}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1462, type: !19, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1462, type: !19, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1463, type: !19, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1466, type: !104, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1584, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 3)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1585, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 15)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1586, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 12)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1587, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 10)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1588, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 11)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1589, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 17)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1590, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 9)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1591, type: !178, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1592, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 13)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1593, type: !210, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1594, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 4)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 1024, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 16)
!223 = !{i32 7, !"Dwarf Version", i32 5}
!224 = !{i32 2, !"Debug Info Version", i32 3}
!225 = !{i32 1, !"wchar_size", i32 4}
!226 = !{i32 8, !"PIC Level", i32 2}
!227 = !{i32 7, !"PIE Level", i32 2}
!228 = !{i32 7, !"uwtable", i32 2}
!229 = !{i32 7, !"frame-pointer", i32 2}
!230 = !{!"Ubuntu clang version 21.1.5 (++20251023083201+45afac62e373-1~exp1~20251023083316.53)"}
!231 = distinct !DISubprogram(name: "bz_config_ok", scope: !2, file: !2, line: 136, type: !232, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34)
!232 = !DISubroutineType(types: !233)
!233 = !{!76}
!234 = !DILocation(line: 141, column: 4, scope: !231)
!235 = distinct !DISubprogram(name: "default_bzalloc", scope: !2, file: !2, line: 147, type: !236, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !238)
!236 = !DISubroutineType(types: !237)
!237 = !{!53, !53, !135, !135}
!238 = !{}
!239 = !DILocalVariable(name: "opaque", arg: 1, scope: !235, file: !2, line: 147, type: !53)
!240 = !DILocation(line: 147, column: 31, scope: !235)
!241 = !DILocalVariable(name: "items", arg: 2, scope: !235, file: !2, line: 147, type: !135)
!242 = !DILocation(line: 147, column: 45, scope: !235)
!243 = !DILocalVariable(name: "size", arg: 3, scope: !235, file: !2, line: 147, type: !135)
!244 = !DILocation(line: 147, column: 58, scope: !235)
!245 = !DILocalVariable(name: "v", scope: !235, file: !2, line: 149, type: !53)
!246 = !DILocation(line: 149, column: 10, scope: !235)
!247 = !DILocation(line: 149, column: 23, scope: !235)
!248 = !DILocation(line: 149, column: 31, scope: !235)
!249 = !DILocation(line: 149, column: 29, scope: !235)
!250 = !DILocation(line: 149, column: 14, scope: !235)
!251 = !DILocation(line: 150, column: 11, scope: !235)
!252 = !DILocation(line: 150, column: 4, scope: !235)
!253 = distinct !DISubprogram(name: "default_bzfree", scope: !2, file: !2, line: 154, type: !157, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !238)
!254 = !DILocalVariable(name: "opaque", arg: 1, scope: !253, file: !2, line: 154, type: !53)
!255 = !DILocation(line: 154, column: 29, scope: !253)
!256 = !DILocalVariable(name: "addr", arg: 2, scope: !253, file: !2, line: 154, type: !53)
!257 = !DILocation(line: 154, column: 43, scope: !253)
!258 = !DILocation(line: 156, column: 8, scope: !259)
!259 = distinct !DILexicalBlock(scope: !253, file: !2, line: 156, column: 8)
!260 = !DILocation(line: 156, column: 13, scope: !259)
!261 = !DILocation(line: 156, column: 29, scope: !259)
!262 = !DILocation(line: 156, column: 22, scope: !259)
!263 = !DILocation(line: 157, column: 1, scope: !253)
!264 = distinct !DISubprogram(name: "init_RL", scope: !2, file: !2, line: 176, type: !265, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !238)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !56, line: 300, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 231, size: 446144, elements: !270)
!270 = !{!271, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !312, !316, !317, !321, !323, !324}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !269, file: !56, line: 233, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !269, file: !56, line: 237, baseType: !135, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !269, file: !56, line: 238, baseType: !135, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !269, file: !56, line: 241, baseType: !62, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !269, file: !56, line: 244, baseType: !61, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !269, file: !56, line: 245, baseType: !61, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !269, file: !56, line: 246, baseType: !61, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !269, file: !56, line: 247, baseType: !135, size: 32, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !269, file: !56, line: 250, baseType: !61, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !269, file: !56, line: 251, baseType: !54, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !269, file: !56, line: 252, baseType: !58, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !269, file: !56, line: 253, baseType: !54, size: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !269, file: !56, line: 256, baseType: !135, size: 32, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !269, file: !56, line: 259, baseType: !62, size: 32, offset: 736)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !269, file: !56, line: 260, baseType: !135, size: 32, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !269, file: !56, line: 261, baseType: !135, size: 32, offset: 800)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !269, file: !56, line: 261, baseType: !135, size: 32, offset: 832)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !269, file: !56, line: 264, baseType: !135, size: 32, offset: 864)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !269, file: !56, line: 265, baseType: !135, size: 32, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !269, file: !56, line: 266, baseType: !135, size: 32, offset: 928)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !269, file: !56, line: 267, baseType: !135, size: 32, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !269, file: !56, line: 270, baseType: !135, size: 32, offset: 992)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !269, file: !56, line: 271, baseType: !295, size: 2048, offset: 1024)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2048, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !269, file: !56, line: 272, baseType: !299, size: 2048, offset: 3072)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2048, elements: !296)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !269, file: !56, line: 275, baseType: !62, size: 32, offset: 5120)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !269, file: !56, line: 276, baseType: !135, size: 32, offset: 5152)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !269, file: !56, line: 279, baseType: !62, size: 32, offset: 5184)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !269, file: !56, line: 280, baseType: !62, size: 32, offset: 5216)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !269, file: !56, line: 283, baseType: !135, size: 32, offset: 5248)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !269, file: !56, line: 284, baseType: !135, size: 32, offset: 5280)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !269, file: !56, line: 285, baseType: !135, size: 32, offset: 5312)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !269, file: !56, line: 288, baseType: !135, size: 32, offset: 5344)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !269, file: !56, line: 289, baseType: !309, size: 8256, offset: 5376)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8256, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 258)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !269, file: !56, line: 290, baseType: !313, size: 144016, offset: 13632)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 144016, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 18002)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !269, file: !56, line: 291, baseType: !313, size: 144016, offset: 157648)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !269, file: !56, line: 293, baseType: !318, size: 12384, offset: 301664)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 12384, elements: !319)
!319 = !{!320, !311}
!320 = !DISubrange(count: 6)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !269, file: !56, line: 294, baseType: !322, size: 49536, offset: 314048)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 49536, elements: !319)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !269, file: !56, line: 295, baseType: !322, size: 49536, offset: 363584)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !269, file: !56, line: 297, baseType: !325, size: 33024, offset: 413120)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 33024, elements: !326)
!326 = !{!311, !219}
!327 = !DILocalVariable(name: "s", arg: 1, scope: !264, file: !2, line: 176, type: !267)
!328 = !DILocation(line: 176, column: 24, scope: !264)
!329 = !DILocation(line: 178, column: 4, scope: !264)
!330 = !DILocation(line: 178, column: 7, scope: !264)
!331 = !DILocation(line: 178, column: 20, scope: !264)
!332 = !DILocation(line: 179, column: 4, scope: !264)
!333 = !DILocation(line: 179, column: 7, scope: !264)
!334 = !DILocation(line: 179, column: 20, scope: !264)
!335 = !DILocation(line: 180, column: 1, scope: !264)
!336 = distinct !DISubprogram(name: "prepare_new_block", scope: !2, file: !2, line: 162, type: !265, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !238)
!337 = !DILocalVariable(name: "s", arg: 1, scope: !336, file: !2, line: 162, type: !267)
!338 = !DILocation(line: 162, column: 34, scope: !336)
!339 = !DILocalVariable(name: "i", scope: !336, file: !2, line: 164, type: !135)
!340 = !DILocation(line: 164, column: 10, scope: !336)
!341 = !DILocation(line: 165, column: 4, scope: !336)
!342 = !DILocation(line: 165, column: 7, scope: !336)
!343 = !DILocation(line: 165, column: 14, scope: !336)
!344 = !DILocation(line: 166, column: 4, scope: !336)
!345 = !DILocation(line: 166, column: 7, scope: !336)
!346 = !DILocation(line: 166, column: 12, scope: !336)
!347 = !DILocation(line: 167, column: 4, scope: !336)
!348 = !DILocation(line: 167, column: 7, scope: !336)
!349 = !DILocation(line: 167, column: 21, scope: !336)
!350 = !DILocation(line: 168, column: 4, scope: !351)
!351 = distinct !DILexicalBlock(scope: !336, file: !2, line: 168, column: 4)
!352 = !DILocation(line: 169, column: 11, scope: !353)
!353 = distinct !DILexicalBlock(scope: !336, file: !2, line: 169, column: 4)
!354 = !DILocation(line: 169, column: 9, scope: !353)
!355 = !DILocation(line: 169, column: 16, scope: !356)
!356 = distinct !DILexicalBlock(scope: !353, file: !2, line: 169, column: 4)
!357 = !DILocation(line: 169, column: 18, scope: !356)
!358 = !DILocation(line: 169, column: 4, scope: !353)
!359 = !DILocation(line: 169, column: 30, scope: !356)
!360 = !DILocation(line: 169, column: 33, scope: !356)
!361 = !DILocation(line: 169, column: 39, scope: !356)
!362 = !DILocation(line: 169, column: 42, scope: !356)
!363 = !DILocation(line: 169, column: 26, scope: !356)
!364 = !DILocation(line: 169, column: 4, scope: !356)
!365 = distinct !{!365, !358, !366, !367}
!366 = !DILocation(line: 169, column: 44, scope: !353)
!367 = !{!"llvm.loop.mustprogress"}
!368 = !DILocation(line: 170, column: 4, scope: !336)
!369 = !DILocation(line: 170, column: 7, scope: !336)
!370 = !DILocation(line: 170, column: 14, scope: !336)
!371 = !DILocation(line: 171, column: 1, scope: !336)
!372 = distinct !DISubprogram(name: "handle_compress", scope: !2, file: !2, line: 406, type: !373, scopeLine: 407, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !238)
!373 = !DISubroutineType(types: !374)
!374 = !{!63, !272}
!375 = !DILocalVariable(name: "strm", arg: 1, scope: !372, file: !2, line: 406, type: !272)
!376 = !DILocation(line: 406, column: 35, scope: !372)
!377 = !DILocalVariable(name: "progress_in", scope: !372, file: !2, line: 408, type: !63)
!378 = !DILocation(line: 408, column: 9, scope: !372)
!379 = !DILocalVariable(name: "progress_out", scope: !372, file: !2, line: 409, type: !63)
!380 = !DILocation(line: 409, column: 9, scope: !372)
!381 = !DILocalVariable(name: "s", scope: !372, file: !2, line: 410, type: !267)
!382 = !DILocation(line: 410, column: 12, scope: !372)
!383 = !DILocation(line: 410, column: 16, scope: !372)
!384 = !DILocation(line: 410, column: 22, scope: !372)
!385 = !DILocation(line: 412, column: 4, scope: !372)
!386 = !DILocation(line: 414, column: 11, scope: !387)
!387 = distinct !DILexicalBlock(scope: !388, file: !2, line: 414, column: 11)
!388 = distinct !DILexicalBlock(scope: !372, file: !2, line: 412, column: 17)
!389 = !DILocation(line: 414, column: 14, scope: !387)
!390 = !DILocation(line: 414, column: 20, scope: !387)
!391 = !DILocation(line: 415, column: 51, scope: !392)
!392 = distinct !DILexicalBlock(scope: !387, file: !2, line: 414, column: 36)
!393 = !DILocation(line: 415, column: 26, scope: !392)
!394 = !DILocation(line: 415, column: 23, scope: !392)
!395 = !DILocation(line: 416, column: 14, scope: !396)
!396 = distinct !DILexicalBlock(scope: !392, file: !2, line: 416, column: 14)
!397 = !DILocation(line: 416, column: 17, scope: !396)
!398 = !DILocation(line: 416, column: 33, scope: !396)
!399 = !DILocation(line: 416, column: 36, scope: !396)
!400 = !DILocation(line: 416, column: 31, scope: !396)
!401 = !DILocation(line: 416, column: 42, scope: !396)
!402 = !DILocation(line: 417, column: 14, scope: !403)
!403 = distinct !DILexicalBlock(scope: !392, file: !2, line: 417, column: 14)
!404 = !DILocation(line: 417, column: 17, scope: !403)
!405 = !DILocation(line: 417, column: 22, scope: !403)
!406 = !DILocation(line: 417, column: 40, scope: !403)
!407 = !DILocation(line: 418, column: 14, scope: !403)
!408 = !DILocation(line: 418, column: 17, scope: !403)
!409 = !DILocation(line: 418, column: 33, scope: !403)
!410 = !DILocation(line: 418, column: 38, scope: !403)
!411 = !DILocation(line: 419, column: 25, scope: !403)
!412 = !DILocation(line: 419, column: 14, scope: !403)
!413 = !DILocation(line: 419, column: 29, scope: !403)
!414 = !DILocation(line: 420, column: 30, scope: !392)
!415 = !DILocation(line: 420, column: 10, scope: !392)
!416 = !DILocation(line: 421, column: 10, scope: !392)
!417 = !DILocation(line: 421, column: 13, scope: !392)
!418 = !DILocation(line: 421, column: 19, scope: !392)
!419 = !DILocation(line: 422, column: 14, scope: !420)
!420 = distinct !DILexicalBlock(scope: !392, file: !2, line: 422, column: 14)
!421 = !DILocation(line: 422, column: 17, scope: !420)
!422 = !DILocation(line: 422, column: 22, scope: !420)
!423 = !DILocation(line: 422, column: 39, scope: !420)
!424 = !DILocation(line: 423, column: 14, scope: !420)
!425 = !DILocation(line: 423, column: 17, scope: !420)
!426 = !DILocation(line: 423, column: 33, scope: !420)
!427 = !DILocation(line: 423, column: 38, scope: !420)
!428 = !DILocation(line: 424, column: 25, scope: !420)
!429 = !DILocation(line: 424, column: 14, scope: !420)
!430 = !DILocation(line: 424, column: 29, scope: !420)
!431 = !DILocation(line: 425, column: 7, scope: !392)
!432 = !DILocation(line: 427, column: 11, scope: !433)
!433 = distinct !DILexicalBlock(scope: !388, file: !2, line: 427, column: 11)
!434 = !DILocation(line: 427, column: 14, scope: !433)
!435 = !DILocation(line: 427, column: 20, scope: !433)
!436 = !DILocation(line: 428, column: 49, scope: !437)
!437 = distinct !DILexicalBlock(scope: !433, file: !2, line: 427, column: 35)
!438 = !DILocation(line: 428, column: 25, scope: !437)
!439 = !DILocation(line: 428, column: 22, scope: !437)
!440 = !DILocation(line: 429, column: 14, scope: !441)
!441 = distinct !DILexicalBlock(scope: !437, file: !2, line: 429, column: 14)
!442 = !DILocation(line: 429, column: 17, scope: !441)
!443 = !DILocation(line: 429, column: 22, scope: !441)
!444 = !DILocation(line: 429, column: 38, scope: !441)
!445 = !DILocation(line: 429, column: 41, scope: !441)
!446 = !DILocation(line: 429, column: 44, scope: !441)
!447 = !DILocation(line: 429, column: 60, scope: !441)
!448 = !DILocation(line: 430, column: 24, scope: !449)
!449 = distinct !DILexicalBlock(scope: !441, file: !2, line: 429, column: 66)
!450 = !DILocation(line: 430, column: 13, scope: !449)
!451 = !DILocation(line: 431, column: 33, scope: !449)
!452 = !DILocation(line: 431, column: 43, scope: !449)
!453 = !DILocation(line: 431, column: 46, scope: !449)
!454 = !DILocation(line: 431, column: 51, scope: !449)
!455 = !DILocation(line: 431, column: 36, scope: !449)
!456 = !DILocation(line: 431, column: 13, scope: !449)
!457 = !DILocation(line: 432, column: 13, scope: !449)
!458 = !DILocation(line: 432, column: 16, scope: !449)
!459 = !DILocation(line: 432, column: 22, scope: !449)
!460 = !DILocation(line: 433, column: 10, scope: !449)
!461 = !DILocation(line: 435, column: 14, scope: !462)
!462 = distinct !DILexicalBlock(scope: !441, file: !2, line: 435, column: 14)
!463 = !DILocation(line: 435, column: 17, scope: !462)
!464 = !DILocation(line: 435, column: 27, scope: !462)
!465 = !DILocation(line: 435, column: 30, scope: !462)
!466 = !DILocation(line: 435, column: 24, scope: !462)
!467 = !DILocation(line: 436, column: 33, scope: !468)
!468 = distinct !DILexicalBlock(scope: !462, file: !2, line: 435, column: 41)
!469 = !DILocation(line: 436, column: 13, scope: !468)
!470 = !DILocation(line: 437, column: 13, scope: !468)
!471 = !DILocation(line: 437, column: 16, scope: !468)
!472 = !DILocation(line: 437, column: 22, scope: !468)
!473 = !DILocation(line: 438, column: 10, scope: !468)
!474 = !DILocation(line: 440, column: 14, scope: !475)
!475 = distinct !DILexicalBlock(scope: !462, file: !2, line: 440, column: 14)
!476 = !DILocation(line: 440, column: 17, scope: !475)
!477 = !DILocation(line: 440, column: 23, scope: !475)
!478 = !DILocation(line: 440, column: 32, scope: !475)
!479 = !DILocation(line: 441, column: 13, scope: !480)
!480 = distinct !DILexicalBlock(scope: !475, file: !2, line: 440, column: 38)
!481 = !DILocation(line: 443, column: 7, scope: !437)
!482 = distinct !{!482, !385, !483}
!483 = !DILocation(line: 445, column: 4, scope: !372)
!484 = !DILocation(line: 447, column: 11, scope: !372)
!485 = !DILocation(line: 447, column: 23, scope: !372)
!486 = !DILocation(line: 447, column: 26, scope: !372)
!487 = !DILocation(line: 447, column: 4, scope: !372)
!488 = distinct !DISubprogram(name: "isempty_RL", scope: !2, file: !2, line: 184, type: !489, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !238)
!489 = !DISubroutineType(types: !490)
!490 = !{!63, !267}
!491 = !DILocalVariable(name: "s", arg: 1, scope: !488, file: !2, line: 184, type: !267)
!492 = !DILocation(line: 184, column: 27, scope: !488)
!493 = !DILocation(line: 186, column: 8, scope: !494)
!494 = distinct !DILexicalBlock(scope: !488, file: !2, line: 186, column: 8)
!495 = !DILocation(line: 186, column: 11, scope: !494)
!496 = !DILocation(line: 186, column: 23, scope: !494)
!497 = !DILocation(line: 186, column: 29, scope: !494)
!498 = !DILocation(line: 186, column: 32, scope: !494)
!499 = !DILocation(line: 186, column: 35, scope: !494)
!500 = !DILocation(line: 186, column: 48, scope: !494)
!501 = !DILocation(line: 187, column: 7, scope: !494)
!502 = !DILocation(line: 188, column: 7, scope: !494)
!503 = !DILocation(line: 189, column: 1, scope: !488)
!504 = distinct !DISubprogram(name: "unRLE_obuf_to_output_SMALL", scope: !2, file: !2, line: 750, type: !505, scopeLine: 751, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !238)
!505 = !DISubroutineType(types: !506)
!506 = !{!63, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "DState", file: !56, line: 472, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 382, size: 513152, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !529, !530, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !546, !547, !551, !553, !554, !555, !556, !557, !558, !559, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !585, !586}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !509, file: !56, line: 384, baseType: !272, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !509, file: !56, line: 387, baseType: !135, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_ch", scope: !509, file: !56, line: 390, baseType: !55, size: 8, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_len", scope: !509, file: !56, line: 391, baseType: !135, size: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "blockRandomised", scope: !509, file: !56, line: 392, baseType: !63, size: 8, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !509, file: !56, line: 393, baseType: !135, size: 32, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !509, file: !56, line: 393, baseType: !135, size: 32, offset: 224)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !509, file: !56, line: 396, baseType: !62, size: 32, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !509, file: !56, line: 397, baseType: !135, size: 32, offset: 288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !509, file: !56, line: 400, baseType: !135, size: 32, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "smallDecompress", scope: !509, file: !56, line: 401, baseType: !63, size: 8, offset: 352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "currBlockNo", scope: !509, file: !56, line: 402, baseType: !135, size: 32, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !509, file: !56, line: 403, baseType: !135, size: 32, offset: 416)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !509, file: !56, line: 406, baseType: !135, size: 32, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tPos", scope: !509, file: !56, line: 407, baseType: !62, size: 32, offset: 480)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !509, file: !56, line: 408, baseType: !135, size: 32, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "unzftab", scope: !509, file: !56, line: 409, baseType: !528, size: 8192, offset: 544)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8192, elements: !296)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nblock_used", scope: !509, file: !56, line: 410, baseType: !135, size: 32, offset: 8736)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cftab", scope: !509, file: !56, line: 411, baseType: !531, size: 8224, offset: 8768)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8224, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 257)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "cftabCopy", scope: !509, file: !56, line: 412, baseType: !531, size: 8224, offset: 16992)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !509, file: !56, line: 415, baseType: !61, size: 64, offset: 25216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ll16", scope: !509, file: !56, line: 418, baseType: !58, size: 64, offset: 25280)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ll4", scope: !509, file: !56, line: 419, baseType: !54, size: 64, offset: 25344)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "storedBlockCRC", scope: !509, file: !56, line: 422, baseType: !62, size: 32, offset: 25408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "storedCombinedCRC", scope: !509, file: !56, line: 423, baseType: !62, size: 32, offset: 25440)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedBlockCRC", scope: !509, file: !56, line: 424, baseType: !62, size: 32, offset: 25472)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedCombinedCRC", scope: !509, file: !56, line: 425, baseType: !62, size: 32, offset: 25504)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !509, file: !56, line: 428, baseType: !135, size: 32, offset: 25536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !509, file: !56, line: 429, baseType: !295, size: 2048, offset: 25568)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "inUse16", scope: !509, file: !56, line: 430, baseType: !545, size: 128, offset: 27616)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !221)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "seqToUnseq", scope: !509, file: !56, line: 431, baseType: !299, size: 2048, offset: 27744)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mtfa", scope: !509, file: !56, line: 434, baseType: !548, size: 32768, offset: 29792)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32768, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 4096)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mtfbase", scope: !509, file: !56, line: 435, baseType: !552, size: 512, offset: 62560)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 512, elements: !221)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !509, file: !56, line: 436, baseType: !313, size: 144016, offset: 63072)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !509, file: !56, line: 437, baseType: !313, size: 144016, offset: 207088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !509, file: !56, line: 438, baseType: !318, size: 12384, offset: 351104)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !509, file: !56, line: 440, baseType: !322, size: 49536, offset: 363488)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !509, file: !56, line: 441, baseType: !322, size: 49536, offset: 413024)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !509, file: !56, line: 442, baseType: !322, size: 49536, offset: 462560)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "minLens", scope: !509, file: !56, line: 443, baseType: !560, size: 192, offset: 512096)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 192, elements: !561)
!561 = !{!320}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "save_i", scope: !509, file: !56, line: 446, baseType: !135, size: 32, offset: 512288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "save_j", scope: !509, file: !56, line: 447, baseType: !135, size: 32, offset: 512320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "save_t", scope: !509, file: !56, line: 448, baseType: !135, size: 32, offset: 512352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "save_alphaSize", scope: !509, file: !56, line: 449, baseType: !135, size: 32, offset: 512384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "save_nGroups", scope: !509, file: !56, line: 450, baseType: !135, size: 32, offset: 512416)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "save_nSelectors", scope: !509, file: !56, line: 451, baseType: !135, size: 32, offset: 512448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "save_EOB", scope: !509, file: !56, line: 452, baseType: !135, size: 32, offset: 512480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupNo", scope: !509, file: !56, line: 453, baseType: !135, size: 32, offset: 512512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupPos", scope: !509, file: !56, line: 454, baseType: !135, size: 32, offset: 512544)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "save_nextSym", scope: !509, file: !56, line: 455, baseType: !135, size: 32, offset: 512576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblockMAX", scope: !509, file: !56, line: 456, baseType: !135, size: 32, offset: 512608)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblock", scope: !509, file: !56, line: 457, baseType: !135, size: 32, offset: 512640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "save_es", scope: !509, file: !56, line: 458, baseType: !135, size: 32, offset: 512672)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "save_N", scope: !509, file: !56, line: 459, baseType: !135, size: 32, offset: 512704)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "save_curr", scope: !509, file: !56, line: 460, baseType: !135, size: 32, offset: 512736)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "save_zt", scope: !509, file: !56, line: 461, baseType: !135, size: 32, offset: 512768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "save_zn", scope: !509, file: !56, line: 462, baseType: !135, size: 32, offset: 512800)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "save_zvec", scope: !509, file: !56, line: 463, baseType: !135, size: 32, offset: 512832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "save_zj", scope: !509, file: !56, line: 464, baseType: !135, size: 32, offset: 512864)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "save_gSel", scope: !509, file: !56, line: 465, baseType: !135, size: 32, offset: 512896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "save_gMinlen", scope: !509, file: !56, line: 466, baseType: !135, size: 32, offset: 512928)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "save_gLimit", scope: !509, file: !56, line: 467, baseType: !584, size: 64, offset: 512960)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "save_gBase", scope: !509, file: !56, line: 468, baseType: !584, size: 64, offset: 513024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "save_gPerm", scope: !509, file: !56, line: 469, baseType: !584, size: 64, offset: 513088)
!587 = !DILocalVariable(name: "s", arg: 1, scope: !504, file: !2, line: 750, type: !507)
!588 = !DILocation(line: 750, column: 43, scope: !504)
!589 = !DILocalVariable(name: "k1", scope: !504, file: !2, line: 752, type: !55)
!590 = !DILocation(line: 752, column: 10, scope: !504)
!591 = !DILocation(line: 754, column: 8, scope: !592)
!592 = distinct !DILexicalBlock(scope: !504, file: !2, line: 754, column: 8)
!593 = !DILocation(line: 754, column: 11, scope: !592)
!594 = !DILocation(line: 756, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !592, file: !2, line: 754, column: 28)
!596 = !DILocation(line: 758, column: 10, scope: !597)
!597 = distinct !DILexicalBlock(scope: !595, file: !2, line: 756, column: 20)
!598 = !DILocation(line: 759, column: 17, scope: !599)
!599 = distinct !DILexicalBlock(scope: !600, file: !2, line: 759, column: 17)
!600 = distinct !DILexicalBlock(scope: !597, file: !2, line: 758, column: 23)
!601 = !DILocation(line: 759, column: 20, scope: !599)
!602 = !DILocation(line: 759, column: 26, scope: !599)
!603 = !DILocation(line: 759, column: 36, scope: !599)
!604 = !DILocation(line: 759, column: 42, scope: !599)
!605 = !DILocation(line: 760, column: 17, scope: !606)
!606 = distinct !DILexicalBlock(scope: !600, file: !2, line: 760, column: 17)
!607 = !DILocation(line: 760, column: 20, scope: !606)
!608 = !DILocation(line: 760, column: 34, scope: !606)
!609 = !DILocation(line: 760, column: 40, scope: !606)
!610 = !DILocation(line: 761, column: 48, scope: !600)
!611 = !DILocation(line: 761, column: 51, scope: !600)
!612 = !DILocation(line: 761, column: 25, scope: !600)
!613 = !DILocation(line: 761, column: 28, scope: !600)
!614 = !DILocation(line: 761, column: 34, scope: !600)
!615 = !DILocation(line: 761, column: 46, scope: !600)
!616 = !DILocation(line: 762, column: 13, scope: !617)
!617 = distinct !DILexicalBlock(scope: !600, file: !2, line: 762, column: 13)
!618 = !DILocation(line: 763, column: 13, scope: !600)
!619 = !DILocation(line: 763, column: 16, scope: !600)
!620 = !DILocation(line: 763, column: 29, scope: !600)
!621 = !DILocation(line: 764, column: 13, scope: !600)
!622 = !DILocation(line: 764, column: 16, scope: !600)
!623 = !DILocation(line: 764, column: 22, scope: !600)
!624 = !DILocation(line: 764, column: 30, scope: !600)
!625 = !DILocation(line: 765, column: 13, scope: !600)
!626 = !DILocation(line: 765, column: 16, scope: !600)
!627 = !DILocation(line: 765, column: 22, scope: !600)
!628 = !DILocation(line: 765, column: 31, scope: !600)
!629 = !DILocation(line: 766, column: 13, scope: !600)
!630 = !DILocation(line: 766, column: 16, scope: !600)
!631 = !DILocation(line: 766, column: 22, scope: !600)
!632 = !DILocation(line: 766, column: 36, scope: !600)
!633 = !DILocation(line: 767, column: 17, scope: !634)
!634 = distinct !DILexicalBlock(scope: !600, file: !2, line: 767, column: 17)
!635 = !DILocation(line: 767, column: 20, scope: !634)
!636 = !DILocation(line: 767, column: 26, scope: !634)
!637 = !DILocation(line: 767, column: 41, scope: !634)
!638 = !DILocation(line: 767, column: 47, scope: !634)
!639 = !DILocation(line: 767, column: 50, scope: !634)
!640 = !DILocation(line: 767, column: 56, scope: !634)
!641 = !DILocation(line: 767, column: 70, scope: !634)
!642 = distinct !{!642, !596, !643}
!643 = !DILocation(line: 768, column: 10, scope: !597)
!644 = !DILocation(line: 771, column: 14, scope: !645)
!645 = distinct !DILexicalBlock(scope: !597, file: !2, line: 771, column: 14)
!646 = !DILocation(line: 771, column: 17, scope: !645)
!647 = !DILocation(line: 771, column: 32, scope: !645)
!648 = !DILocation(line: 771, column: 35, scope: !645)
!649 = !DILocation(line: 771, column: 46, scope: !645)
!650 = !DILocation(line: 771, column: 29, scope: !645)
!651 = !DILocation(line: 771, column: 50, scope: !645)
!652 = !DILocation(line: 774, column: 14, scope: !653)
