; ModuleID = '/tmp/autojit_4f0e030a358521399cbed216e6c35c26'
source_filename = "compress.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.EState = type { ptr, i32, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [62 x i8] c"    block %d: crc = 0x%08x, combined CRC = 0x%08x, size = %d\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [36 x i8] c"    final combined CRC = 0x%08x\0A   \00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [64 x i8] c"      %d in block, %d after MTF & 1-2 coding, %d+2 syms in use\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [59 x i8] c"      initial group %d, [%d .. %d], has %d syms (%4.1f%%)\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [41 x i8] c"      pass %d: size is %d, grp uses are \00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [4 x i8] c"%d \00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [26 x i8] c"      bytes: mapping %d, \00", align 1, !dbg !37

!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 306, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 64)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 347, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 59)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 481, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 41)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 484, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 4)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 485, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 2)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 558, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 26)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 15)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 586, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 18)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 641, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 10)
!57 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 21.1.5 (++20251023083201+45afac62e373-1~exp1~20251023083316.53)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !58, globals: !67, splitDebugInlining: false, nameTableKind: None)
!58 = !{!59, !60, !63, !65, !66}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !61, line: 83, baseType: !62)
!61 = !DIFile(filename: "./bzlib_private.h", directory: "/home/ez/Develop/llvm-project-main/build-external-llvm21/install/benchmark/bzip2/build_regular", checksumkind: CSK_MD5, checksum: "5325523d55f5e1fa9d9d8a95214ec2fe")
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !61, line: 85, baseType: !64)
!64 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !61, line: 82, baseType: !62)
!66 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!67 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52}
!68 = !{i32 7, !"Dwarf Version", i32 5}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{i32 1, !"wchar_size", i32 4}
!71 = !{i32 8, !"PIC Level", i32 2}
!72 = !{i32 7, !"PIE Level", i32 2}
!73 = !{i32 7, !"uwtable", i32 2}
!74 = !{i32 7, !"frame-pointer", i32 2}
!75 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!76 = !{!"Ubuntu clang version 21.1.5 (++20251023083201+45afac62e373-1~exp1~20251023083316.53)"}
!77 = distinct !DISubprogram(name: "BZ2_bsInitWrite", scope: !2, file: !2, line: 81, type: !78, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !170)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !61, line: 300, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 231, size: 446144, elements: !83)
!83 = !{!84, !111, !113, !114, !115, !117, !118, !119, !120, !121, !122, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !141, !143, !144, !145, !146, !147, !148, !149, !150, !151, !155, !159, !160, !164, !166, !167}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !82, file: !61, line: 233, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !87, line: 106, baseType: !88)
!87 = !DIFile(filename: "./bzlib.h", directory: "/home/ez/Develop/llvm-project-main/build-external-llvm21/install/benchmark/bzip2/build_regular", checksumkind: CSK_MD5, checksum: "2630d715580548e1aacc6fac1a21250d")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 89, size: 640, elements: !89)
!89 = !{!90, !92, !93, !94, !95, !96, !97, !98, !99, !101, !106, !110}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !88, file: !87, line: 90, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !88, file: !87, line: 91, baseType: !64, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !88, file: !87, line: 92, baseType: !64, size: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !88, file: !87, line: 93, baseType: !64, size: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !88, file: !87, line: 95, baseType: !91, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !88, file: !87, line: 96, baseType: !64, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !88, file: !87, line: 97, baseType: !64, size: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !88, file: !87, line: 98, baseType: !64, size: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !88, file: !87, line: 100, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !88, file: !87, line: 102, baseType: !102, size: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!100, !100, !105, !105}
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !88, file: !87, line: 103, baseType: !107, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !100, !100}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !88, file: !87, line: 104, baseType: !100, size: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !82, file: !61, line: 237, baseType: !112, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !61, line: 84, baseType: !105)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !82, file: !61, line: 238, baseType: !112, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !82, file: !61, line: 241, baseType: !63, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !82, file: !61, line: 244, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !82, file: !61, line: 245, baseType: !116, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !82, file: !61, line: 246, baseType: !116, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !82, file: !61, line: 247, baseType: !112, size: 32, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !82, file: !61, line: 250, baseType: !116, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !82, file: !61, line: 251, baseType: !59, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !82, file: !61, line: 252, baseType: !123, size: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !61, line: 87, baseType: !125)
!125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !82, file: !61, line: 253, baseType: !59, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !82, file: !61, line: 256, baseType: !112, size: 32, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !82, file: !61, line: 259, baseType: !63, size: 32, offset: 736)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !82, file: !61, line: 260, baseType: !112, size: 32, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !82, file: !61, line: 261, baseType: !112, size: 32, offset: 800)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !82, file: !61, line: 261, baseType: !112, size: 32, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !82, file: !61, line: 264, baseType: !112, size: 32, offset: 864)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !82, file: !61, line: 265, baseType: !112, size: 32, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !82, file: !61, line: 266, baseType: !112, size: 32, offset: 928)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !82, file: !61, line: 267, baseType: !112, size: 32, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !82, file: !61, line: 270, baseType: !112, size: 32, offset: 992)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !82, file: !61, line: 271, baseType: !138, size: 2048, offset: 1024)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2048, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !82, file: !61, line: 272, baseType: !142, size: 2048, offset: 3072)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !139)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !82, file: !61, line: 275, baseType: !63, size: 32, offset: 5120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !82, file: !61, line: 276, baseType: !112, size: 32, offset: 5152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !82, file: !61, line: 279, baseType: !63, size: 32, offset: 5184)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !82, file: !61, line: 280, baseType: !63, size: 32, offset: 5216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !82, file: !61, line: 283, baseType: !112, size: 32, offset: 5248)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !82, file: !61, line: 284, baseType: !112, size: 32, offset: 5280)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !82, file: !61, line: 285, baseType: !112, size: 32, offset: 5312)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !82, file: !61, line: 288, baseType: !112, size: 32, offset: 5344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !82, file: !61, line: 289, baseType: !152, size: 8256, offset: 5376)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 8256, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 258)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !82, file: !61, line: 290, baseType: !156, size: 144016, offset: 13632)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 144016, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 18002)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !82, file: !61, line: 291, baseType: !156, size: 144016, offset: 157648)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !82, file: !61, line: 293, baseType: !161, size: 12384, offset: 301664)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 12384, elements: !162)
!162 = !{!163, !154}
!163 = !DISubrange(count: 6)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !82, file: !61, line: 294, baseType: !165, size: 49536, offset: 314048)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 49536, elements: !162)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !82, file: !61, line: 295, baseType: !165, size: 49536, offset: 363584)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !82, file: !61, line: 297, baseType: !168, size: 33024, offset: 413120)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 33024, elements: !169)
!169 = !{!154, !31}
!170 = !{}
!171 = !DILocalVariable(name: "s", arg: 1, scope: !77, file: !2, line: 81, type: !80)
!172 = !DILocation(line: 81, column: 32, scope: !77)
!173 = !DILocation(line: 83, column: 4, scope: !77)
!174 = !DILocation(line: 83, column: 7, scope: !77)
!175 = !DILocation(line: 83, column: 14, scope: !77)
!176 = !DILocation(line: 84, column: 4, scope: !77)
!177 = !DILocation(line: 84, column: 7, scope: !77)
!178 = !DILocation(line: 84, column: 14, scope: !77)
!179 = !DILocation(line: 85, column: 1, scope: !77)
!180 = distinct !DISubprogram(name: "bsPutUChar", scope: !2, file: !2, line: 138, type: !181, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !57, retainedNodes: !170)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !80, !60}
!183 = !DILocalVariable(name: "s", arg: 1, scope: !180, file: !2, line: 138, type: !80)
!184 = !DILocation(line: 138, column: 27, scope: !180)
!185 = !DILocalVariable(name: "c", arg: 2, scope: !180, file: !2, line: 138, type: !60)
!186 = !DILocation(line: 138, column: 36, scope: !180)
!187 = !DILocation(line: 140, column: 9, scope: !180)
!188 = !DILocation(line: 140, column: 23, scope: !180)
!189 = !DILocation(line: 140, column: 15, scope: !180)
!190 = !DILocation(line: 140, column: 4, scope: !180)
!191 = !DILocation(line: 141, column: 1, scope: !180)
!192 = distinct !DISubprogram(name: "bsPutUInt32", scope: !2, file: !2, line: 127, type: !193, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !57, retainedNodes: !170)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !80, !63}
!195 = !DILocalVariable(name: "s", arg: 1, scope: !192, file: !2, line: 127, type: !80)
!196 = !DILocation(line: 127, column: 28, scope: !192)
!197 = !DILocalVariable(name: "u", arg: 2, scope: !192, file: !2, line: 127, type: !63)
!198 = !DILocation(line: 127, column: 38, scope: !192)
!199 = !DILocation(line: 129, column: 10, scope: !192)
!200 = !DILocation(line: 129, column: 17, scope: !192)
!201 = !DILocation(line: 129, column: 19, scope: !192)
!202 = !DILocation(line: 129, column: 16, scope: !192)
!203 = !DILocation(line: 129, column: 26, scope: !192)
!204 = !DILocation(line: 129, column: 4, scope: !192)
!205 = !DILocation(line: 130, column: 10, scope: !192)
!206 = !DILocation(line: 130, column: 17, scope: !192)
!207 = !DILocation(line: 130, column: 19, scope: !192)
!208 = !DILocation(line: 130, column: 16, scope: !192)
!209 = !DILocation(line: 130, column: 26, scope: !192)
!210 = !DILocation(line: 130, column: 4, scope: !192)
!211 = !DILocation(line: 131, column: 10, scope: !192)
!212 = !DILocation(line: 131, column: 17, scope: !192)
!213 = !DILocation(line: 131, column: 19, scope: !192)
!214 = !DILocation(line: 131, column: 16, scope: !192)
!215 = !DILocation(line: 131, column: 26, scope: !192)
!216 = !DILocation(line: 131, column: 4, scope: !192)
!217 = !DILocation(line: 132, column: 10, scope: !192)
!218 = !DILocation(line: 132, column: 17, scope: !192)
!219 = !DILocation(line: 132, column: 26, scope: !192)
!220 = !DILocation(line: 132, column: 4, scope: !192)
!221 = !DILocation(line: 133, column: 1, scope: !192)
!222 = distinct !DISubprogram(name: "bsW", scope: !2, file: !2, line: 117, type: !223, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !57, retainedNodes: !170)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !80, !112, !63}
!225 = !DILocalVariable(name: "s", arg: 1, scope: !222, file: !2, line: 117, type: !80)
!226 = !DILocation(line: 117, column: 20, scope: !222)
!227 = !DILocalVariable(name: "n", arg: 2, scope: !222, file: !2, line: 117, type: !112)
!228 = !DILocation(line: 117, column: 29, scope: !222)
